<script>
    import Title from "$lib/Elements/Title.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import P from "$lib/Markup/P.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
    import Math from "$lib/Math/Math.svelte"
    import Code from "$lib/Code/Code.svelte"
</script>

<Title title="Поисковые структуры"
/>

<Par>
    <P>
        Сама задача поиска очень абстрактная.
    </P>
</Par>

<Subheading>Ассоциативные массивы</Subheading>

<Par>
    <P>
        Абстрактная структура данных <b>ассоциативный массив</b> (<Code c="assoc"/>) &mdash; структура,
        в которой хранятся значения вместе с ассоциированными с ними уникальными ключами.
    </P>
    <P>
        Задача поиска в этой структуре &mdash; найти значение, связанное с данным ключом,
        или установить, что такого значения в структуре нет.
    </P>
    <P>
        Формально, нам задано инъективное отображение ассоциации <Math m={`a \\colon K \\injto V`}/>
        между множеством ключей <Math m={`K`}/> и множеством значений <Math m={`V`}/>.
    </P>
</Par>

<Par>
    <P>
        Иногда один ключ может быть связан с несколькими значениями.
        Такое расширение ассоциативного массива называется <b>мультиассоциативным массивом</b> (<Code c="multiassoc"/>).
    </P>
    <P>
        При поиске возвращается коллекция (итератор, набор) из всех значений, ассоциированных с данным ключом.
        Если ничего не найдено, то возвращаемая коллекция пустая.
    </P>

    <P>
        Формально, нам отображение ассоциации превращается в отображение <Math m={`a \\colon K \\injto 2^V`}/>
        между множеством ключей <Math m={`K`}/> и булеаном множества значений <Math m={`V`}/>.
    </P>

    <P>
        На самом деле структура коллекции может быть разной.
        Это может быть неупорядоченное множество, а может быть упорядоченный список, и вообще все что угодно.
    </P>
</Par>


<Subheading>Множества</Subheading>

