<script>
  import Heading from "$lib/Markup/Heading.svelte";
  import Par from "$lib/Markup/Par.svelte";
  import P from "$lib/Markup/P.svelte";
  import Subheading from "$lib/Markup/Subheading.svelte";
</script>

<section>
  <Par>
    <P>
      В компьютерных сетях нет единой модели, нет идеальных правил и нет никакой системы.
      Несмотря на это, есть парочка хороших попыток создать модель и систематизировать сетевые взаимодействия.
    </P>
  </Par>

  <Heading>Базовые понятия</Heading>

  <Par>
    <P>
      <b>Хост</b> (host) &mdash; любое устройство в сети, предоставляющее сервисы сетевых взаимодействий.
      Хосты могут иметь любые размеры, от микропроцессоров и умных пылесосов до больших вычислительных кластеров.
    </P>
    <P>
      <b>Сеть</b> &mdash; несколько хостов, связанных друг с другом.
      Связь может быть непосредственной или косвенной, с использованием маршрутизаторов, коммутаторов и прочих
      ретранслирующих устройств.
      Главное, чтобы хосты могли общаться друг с другом.
    </P>
    <P>
      <b>Интерфейс</b> &mdash; точка соединения хоста с сетью.
      Интерфейсы используются хостами для отправки сообщений в сеть и получения сообщений из сети.
    </P>
  </Par>

  <Par>
    <P>Сети можно классифицировать по размеру, топологии, технологии и способам администрирования.</P>
  </Par>

  <Par>
    <P>
      Несколько компьютеров с одним владельцем могут образовывать персональную сеть.
      Компьютеры в одной квартире или здании могут образовывать локальную сеть.
      Огромные сети размером со страны или континенты называют глобальными.
      Самая большая сеть планетарного масштаба называется <b>интернетом</b>.
    </P>
    <P>
      <b>Персональная сеть (PAN)</b> позволяет общаться устройствам вблизи человека.
      Например, персональная сеть может связывать компьютер с принтером.
      Однажды, несколько компаний собрались и разработали беспроводной сети малой дальности, названной Bluetooth, для
      соединения компьютера с периферийными устройствами без проводов.
      PAN может быть так же создана другими технологиями, которые общаются на малых расстояниях, например RFID или NFC.
    </P>
    <P>
      <b>Локальная сеть (LAN)</b> охватывает небольшую территорию: квартиру, дом или группу зданий.
    </P>
  </Par>
</section>