Firefox собирает информацию о ближайших беспроводных точках доступа и IP-адресе вашего компьютера и отправляет эту информацию поставщику услуг геолокации (по умолчанию - службам геолокации Google) для получения данных вашего местоположения.
Каждый раз Firefox будет спрашивать, хотите ли вы поделиться своим местоположением.


Спецификация HTML5 определяет новый атрибут для элемента `<a>` - `ping`.
Этот атрибут содержит один или несколько URI, на которые при клике будет отправлен пинг (POST-запроса).
Этот атрибут нужен, чтобы веб-сайты могли отслеживать клики посетителей.
