<script>
    import Title from "$lib/Elements/Title.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import P from "$lib/Markup/P.svelte"
    import Definition from "$lib/Stencils/Blocks/Definition.svelte"
    import BulletList from "$lib/List/BulletList.svelte"
    import ListItem from "$lib/List/ListItem.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
    import Image from "$lib/Elements/Image.svelte"

    import fonNeymanArchitectureImage from "./fon-neyman-architecture.svg"
    import Par from "$lib/Markup/Par.svelte"
</script>

<Title title="Компьютер"
/>

<Par>

    <P>
        Компьютер нужен людям для исполнения каких-то программ и приложений.
        Все программы состоят из команд, которые выполняет процессор (а иногда несколько процессоров).
    </P>

    <P>
        Компьютером будем называть любое электронное вычислительное устройство:
        человеческий компьютер, смартфон, планшет, умный холодильник и так далее.
    </P>
</Par>

<Heading>Архитектура компьютера</Heading>

<Definition title="Архитектура компьютера">
    <P>
        <b>Архитектура компьютера</b> &mdash; его абстрактное представление, которое отражает структурную, схематическую
        и логическую организацию. В архитектуру компьютера входит
    </P>
    <BulletList>
        <ListItem>структурная схема компьютера</ListItem>
        <ListItem>способы доступа к элементам компьютера</ListItem>
        <ListItem>организация интерфейсов</ListItem>
        <ListItem>набор регистров</ListItem>
        <ListItem>организация и способы адресации памяти</ListItem>
        <ListItem>форматы данных</ListItem>
        <ListItem>набор команд и правила обработки исключений</ListItem>
    </BulletList>
</Definition>

<Par>
    <P>
        Описание архитектуры включает практически всю необходимую информацию об устройстве.
    </P>

</Par>

<Subheading>Архитектура фон Неймана</Subheading>

<Par>

    <P>
        Все современные устройства, которые широко встречаются в нашей жизни, работают базовых принципах архитектуры фон
        Неймана.
    </P>

    <P>
        Компьютер поделен на пять блоков: процессор (в оригинале арифметико-логическое устройство), оперативная память,
        блок
        управления, устройство ввода и вывода.
    </P>
</Par>

<Image src={fonNeymanArchitectureImage} alt="Архитектура фон Неймана"/>

<Par>

    <P>
        Такая архитектура обладает следующими свойствами
    </P>

</Par>

<BulletList wide>
    <ListItem>
        <b>Линейное пространство памяти</b> &mdash; оперативная память представляет собой последовательный набор
        пронумерованных ячеек. Номер ячейки называется её адресом.
    </ListItem>
    <ListItem>
        Код программы и её данные хранятся в одном адресном пространстве оперативной памяти.
    </ListItem>
    <ListItem>
        <b>Последовательное исполнение</b> &mdash; процессор выполняет команды из памяти последовательно.
        Точнее, поведение процессора при выборе команд равносильно последовательному выполнению, при этом следующая
        команда может диктоваться ему извне. Показательный пример &mdash; условные переходы.
    </ListItem>
    <ListItem>
        <b>Нет разницы между командами и данными.</b>
        Команды и данные не различимы процессором.
    </ListItem>
    <ListItem>
        <b>Отсутствие души.</b>
        Компьютеру наплевать на назначение данных и на их логическую нагрузку.
    </ListItem>
</BulletList>

<Par>
    <P>
        Мы не рассматриваем описание низкоуровневых концепций в архитектуре фон Неймана.
        Нас интересуют базовые принципы, на которых строятся все современные архитектуры.
        Друг от друга они отличаются только в небольших деталях, в названиях команд и особых узких функциях.
    </P>
</Par>

