<script>
    import Title from "$lib/Elements/Title.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import P from "$lib/Markup/P.svelte"
    import Statement from "$lib/Stencils/Blocks/Statement.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
    import Codeblock from "$lib/Code/Codeblock.svelte"
    import Code from "$lib/Code/Code.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import Math from "$lib/Math/Math.svelte"
    import BulletList from "$lib/List/BulletList.svelte"
    import ListItem from "$lib/List/ListItem.svelte"
</script>

<Title title="Венецианская техника"
/>

<Par>
    <P>
        Пусть у нас есть какая-то структура данных, представляющая собой прокаченное (мульти)множество.
        То есть это (мульти)множество поддерживает еще какие-то хорошие операции, типа получение минимального элемента.
        Сама структура данных и эти операции могут быть практически любыми.
    </P>
    <P>
        Мы хотим научиться массово обновлять <b>все</b> элементы.
        Например, если это множество чисел, мы можем, например, захотеть прибавлять ко всем элементам какое-то число.
    </P>
    <P>
        Можно тупо выполнять эти операции над каждыми элементами. Долго и неэффективно.
        Для некоторых широко распространенных структур данных существуют мощные модификации,
        позволяющие выполнять массовые операции.
        А можно использовать общую Венецианскую технику, применимую для любых структур.
    </P>
</Par>

<Par>
    <P>
        Основная идея &mdash; вместо реальных массовых изменений всех элементов
        хранить эти массовые изменения отдельно, не трогая сами элементы.
        Когда нужно получить значение элемента,
        мы просто применим все хранящиеся массовые изменения к этому элементу.
    </P>
    <P>
        Отсюда возникает основное требование к массовым изменениям:
        они должны коммутировать со всеми другими изменениями, которые могут происходить с элементами.
        А еще, если нужно накапливать несколько массовых изменений, дополнительно нужно,
        чтобы композиция массовых изменений была ассоциативна.
    </P>
</Par>