<script>
    import Title from "$lib/Elements/Title.svelte"
    import P from "$lib/Markup/P.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import Math from "$lib/Math/Math.svelte"
</script>

<Title title="Формальные языки"
/>

<Par>
    <P>
        Возьмем какой-то конечный набор простых объектов, которые назовем символами или буквами.
    </P>
    <P>
        <b>Алфавит</b> &mdash; конечное множество символов или букв.
    </P>
    <P>
        Например, взяв латинские буквы, мы получим английский алфавит <Math m={`A = \\{a, b, c, d, \\dotsc, x, y, z\\}`}/>.
        Взяв две цифры <Math m="0"/> и <Math m="1"/> можно получить двоичный алфавит <Math m={`B = \\{0, 1\\}`}/>.
        Особого внимания заслуживает пустой алфавит <Math m="E = \nothing"/>.
    </P>
</Par>

<Par>
    <P>
        Конечная последовательность букв называется <b>словом</b>.
        Например, <Math m="cat"/> &mdash; слово в английском алфавите <Math m="A"/>.
    </P>
    <P>
        В одном слове может быть несколько одинаковых букв.
        Буквы в слове линейно упорядочены, и каждая буква имеет свой порядковый номер.
        В слове <Math m="w"/> букву с номером <Math m="i"/> обозначают <Math m="w_i"/>.
    </P>
</Par>

<Par>
    <P>
        Пусть есть алфавит <Math m="A"/>.
        Множество слов в алфавите <Math m="A"/> обозначается <Math m="A^*"/>.
    </P>
    <P>
        Если <Math m="\alpha = a_1 a_2 \\dots a_k"/> &mdash; слово в алфавите <Math m="A"/>, то <Math m="\alpha \in A^*"/>.
    </P>
</Par>