<script>
    import Heading from "$lib/Markup/Heading.svelte"
    import Definition from "$lib/Stencils/Blocks/Definition.svelte"
    import Math from "$lib/Math/Math.svelte"
    import P from "$lib/Markup/P.svelte"
    import Par from "$lib/Markup/Par.svelte"
</script>

<Heading>Дискретное вероятностное пространство</Heading>

<Par>
    <P>
        <b>Дискретное вероятностное пространство</b> &mdash; пара <Math m="(\Omega, p)"/>,
        где <Math m="\Omega"/> &mdash; множество элементарных исходов
        и <Math m="p \colon \Omega \to [0, 1]"/> &mdash; функция вероятности на <Math m="\Omega"/>.
    </P>
</Par>

<Par>
    <P>
        Множество элементарных исходов <Math m="\Omega"/> &mdash; конечное или счетное множество.
    </P>
    <P>
        Элементы <Math m="\omega \in \Omega"/> называются <b>элементарными исходами</b> или элементарными событиями.
        Смысл этих элементарных исходов в том, что в рамках какого-то эксперимента может произойти один и только один
        исход, который и называется элементарным.
    </P>
</Par>

<Par>
    <P>Например, при броске монеты может выпасть или орел, или решка. Тогда пространство элементарных исходов</P>
    <Math display m={`\\Omega = \\big\\{ \\text{орел}, \\text{решка} \\big\\}`}/>

    <P>При броске кубика может выпасть любое целое число от <Math m="1"/> до <Math m="6"/>. При таком эксперименте</P>
    <Math display m={`\\Omega = \\{ 1, 2, 3, 4, 5, 6 \\}`}/>

    <P>Если мы бросаем две монеты, то исходов у нас <Math m="4"/>, поскольку всего различных комбинаций результатов
        бросков <Math m="4"/>.</P>
    <Math display
          m={`\\Omega = \\{ \\text{орел и орел}, \\text{орел и решка}, \\text{решка и орел}, \\text{решка и решка} \\}`}/>
</Par>

<Par>
    <P>
        <b>Событие</b> <Math m="A"/> &mdash; подмножество <Math m="A \subseteq \Omega"/> множества элементарных исходов
    </P>
<P>
    Например, для броска кубика с <Math m={`\\Omega = \\{1, 2, 3, 4, 5, 6\\}`}/>
    событиями могут являться множества
    &laquo;выпало <Math m={`4`}/>&raquo; &mdash; <Math m={`\\{4\\}`}/>;
    &laquo;выпало нечётное число&raquo; &mdash; <Math m={`\\{1, 3, 5\\}`}/>;
    &laquo;куб брошен&raquo; (выпало хоть что-то) &mdash; <Math m={`\\Omega`}/>.
</P>
<P>
    Над событиями можно совершать те же операции, что и над множествами
</P>
<Math display
      m={`\\align{
          A \\union B &= \\text{событие, означающее, что случилось событие}~ A ~\\text{или событие}~ B \\\\
          A \\sect B &= \\text{событие, означающее, что случилось и событие}~ A\\text{,} ~\\text{и событие}~ B \\\\
          \\Omega \\without A = \\overline{A} &= \\text{событие, означающее, что событие}~ A ~\\text{не случилось} \\\\
          A \\symdiff B &= \\text{событие, означающее, что случилось либо событие}~ A\\text{,} ~\\text{либо событие}~ B
          }`}/>
</Par>

<Par>
<P>
    События умеют происходить, и делают это с какой-то вероятностью.
    <b>Вероятность</b> наступления события <Math m={`A`}/> &mdash; величина
</P>
<Math display m={`\\prob(A) \\defeq \\sum_{\\omega \\in A} p(\\omega)`}/>
</Par>
