<script>
    import Title from "$lib/Elements/Title.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import Math from "$lib/Math/Math.svelte"
    import P from "$lib/Markup/P.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
</script>

<Title title="Оптимальная сортировка"
/>

<Heading>Сортировка с минимальным числом сравнений</Heading>

<Par>
<P>
    Задача &laquo;найти алгоритм сортировки с минимальным числом сравнений&raquo; может показаться некорректной,
    потому что вообще минимальное число сравнений <Math m={`0`}/>, ведь есть алгоритмы, не требующие сравнений.
</P>
<P>
    Но мы сейчас говорим только об алгоритмах сортировки,
    которые сортируют элементы множества с заданным на нём отношением линейного порядка.
    В этом контексте понятно, что сравнение &mdash; единственная доступная нам операция,
    поэтому придумывать алгоритмы с наименьшим числом сравнений вполне содержательная и интересная задача.
</P>
</Par>

<Subheading>Оценка снизу</Subheading>

<Par>
<P>
    Пусть <Math m={`k`}/> &mdash; минимальное число сравнений, достаточное для сортировки <Math m={`n`}/> элементов.
    На вопрос &laquo;находятся ли два элемента в отношении <Math m={`\\le`}/>?&raquo;
    можно ответить только двумя способами: да и нет.
    Здесь <Math m={`\\le`}/> &mdash; отношение, по которому производится сортировка.
</P>
<P>
    По ответам на <Math m={`k`}/> вопросов нам нужно однозначно понять, какая из <Math m={`n!`}/> перестановок
    исходных элементов является их отсортированным порядком. Значит,
</P>
<Math display m={`n! \\le 2^k`}/>
<P>
    Применяя формулу Стирлинга для неравенства <Math m={`k \\ge \\lceil \\log_2 n! \\rceil`}/>, получаем оценку
</P>
<Math display m={`k \\ge n \\log_2 n - n / \\ln 2 + \\log_2 n / 2 + O(1)`}/>
</Par>

<Par>
<P>
    Этой оценки почти достигают некоторые разобранные ранее алгоритмы.
</P>
<P>
    Подходит алгоритм бинарных вставок, количество сравнений в котором выражается формулой
</P>
<Math display
      m={`\\sum_{k=1}^n \\lceil \\log_2 n \\rceil = n \\cdot \\lceil \\log_2 n \\rceil - 2^{\\lceil \\log_2 n \\rceil} + 1 = n \\log_2 n - n + O(1)`}/>
<P>

</P>
</Par>