<script>
    import Section from "$lib/kit/Typography/Section.svelte"
    import Paragraph from "$lib/kit/Typography/Paragraph.svelte"
    import Contents from "$lib/kit/Layout/Contents.svelte"
    import OList from "$lib/kit/Lists/EnumList.svelte"
    import Item from "$lib/kit/Lists/Item.svelte"
    import Link from "$lib/kit/Elements/Link.svelte"
    import Title from "$lib/kit/Elements/Title.svelte"
    import Heading from "$lib/kit/Typography/Heading.svelte"
    import BulletList from "$lib/kit/Lists/BulletList.svelte"
    import Note from "$lib/kit/Elements/Note.svelte"
    import Subheading from "$lib/kit/Typography/Subheading.svelte"
</script>

<Title title="Сети и соединения"/>

<Contents>
    <OList>
        <Item>
            <Link to="#ip-address" colorless>IP‑адрес</Link>
        </Item>
        <Item>
            <Link to="#dns" colorless>DNS</Link>
        </Item>
        <Item>
            <Link to="#rfid" colorless>RFID</Link>
        </Item>
        <Item>
            <Link to="#wifi-bluetooth" colorless>Wi-Fi и Bluetooth</Link>
        </Item>
        <Item>
            <Link to="#tracking" colorless>Автономное отслеживание</Link>
        </Item>
    </OList>
</Contents>

<Section>
    <Heading anchor="ip-address">IP‑адрес</Heading>
    <Paragraph>
        IP‑адрес — самый известный и очевидный способ отслеживания. Речь идет про общедоступный адрес
        в интернете, который предоставляет ваш провайдер (мобильный, кабельный, оптоволоконный, кафе, сосед). Провайдер
        ведет журналы о том, кто использовал какой IP‑адрес в определенное время. Эти журналы хранятся годами и могут
        передаваться третьим лицам без вашего ведома. Более того, провайдер записывает все места, куда вы лазили и все
        адреса, куда отправляли запросы.
    </Paragraph>
    <Paragraph>
        Большинство сайтов и ресурсов сохраняют у себя помимо регистрационных данных ваш IP‑адрес. Так же  они могут
        составлять карты взаимодействий и хранить всю историю действий с привязкой к вам и вашему IP‑адресу.
    </Paragraph>
    <Paragraph>Любой сайт, знающий ваш IP‑адрес, может так же узнать</Paragraph>
    <BulletList tight>
        <Item>местоположение (не точное, но минимум регион, а в большинстве случаев и город),</Item>
        <Item>наличие IP‑адреса в черных списках и спам-листах,</Item>
        <Item>регистрационная информация (whois),</Item>
        <Item>что вы загружали с общедоступных ресурсов,</Item>
        <Item>наличие открытых портов и работающих служб.</Item>
    </BulletList>
    <Paragraph>
        По всем этим причинам стоит скрывать свой реальный IP‑адрес, и можно это делать совершенно разными способами.
    </Paragraph>
</Section>

<Section>
    <Heading anchor="dns">DNS</Heading>
    <Note>Ну совсем уж детское объяснение</Note>
    <Paragraph>
        DNS (Domain Name System, система доменных имен) — сервис, используемый вашим браузером, чтобы находить IP-адреса
        других сервисов. По буквенному адресу (домену), например google.com, с помощью DNS-запроса найдет IP-адрес
        142.250.65.174.
    </Paragraph>
    <Paragraph>
        Обычно служба DNS предоставляется интернет-провайдером и автоматически настраивается сетью, к которой
        вы подключаетесь.
    </Paragraph>
</Section>

<Section>
    <Heading anchor="rfid">RFID</Heading>
    <Paragraph>
        RFID (Radio Frequency IDentification, радиочастотная идентификация) — способ идентификации объектов с помощью
        радиосигналов.
        Эта технология используется, например, для бесконтактных платежей.
        Радиосигналы записывают или считывают информацию, хранящуюся на RFID-метках.
        Информация может быть любой — от одного серийного номера до нескольких страниц данных.
    </Paragraph>
    <Paragraph>

        Конечно, телефон обладает RFID-меткой, и RFID можно использоваться для отслеживания.
        RFID-метками так же обладают банковские карты, подарочные карты магазинов, пропуска, ключи от машины, паспорт,
        ценники, бирки на одежде и куча других вещей.
    </Paragraph>
    <Paragraph>
        Это не поможет для удаленной деанонимизации, но это можно использовать для сужения круга поиска или определения
        личности.
        Например, некоторые магазины сканируют и регистрируют все RFID-метки.
        Несмотря на то, что они ищут свои карты, они также могут сохранять информацию о других метках.
        И как только они найдут свою, они могут получить вашу информацию и привязать к ней все обнаруженные RFID-метки.
    </Paragraph>
    <Paragraph>Также считыватели могут быть размещены в совершенно неожиданных местах: метро, окошек в ларьках,
        на стойках магазинов, в турникетах и т. д. (это все реальные случаи).
        Единственный способ решить эту проблему — не иметь при себе RFID-меток или защитить их с помощью клетки Фарадея.
        Можно также использовать специализированные кошельки, которые блокируют RFID-связь.
    </Paragraph>

    <Subheading>RFID-метки в паспортах</Subheading>
    <Paragraph>
        В некоторых странах, например в Малайзии (1998) кроме личных данных записывается история въездов и выездов
        из страны.
        Так же в паспорта вставляют RFID-метки Норвегия (2005), Япония (2006), большинство стран Евросоюза (2006),
        Австралия,
        Гонконг, США (2007), Великобритания (2006), Индия (2008), Сербия (2008), Южная Корея (2008), Тайвань (2008),
        Албания (2009), Филиппины (2009), Македония (2010), Аргентина (2012), Канада (2013), Уругвай (2015) и Израиль
        (2017).
    </Paragraph>
</Section>

<Section>
    <Heading anchor="wifi-bluetooth">Wi-Fi и Bluetooth</Heading>
    <Paragraph>
        Геолокация осуществляется не только за счет GPS и триангуляции мобильных антенн.
        Она так же осуществляется за счет окружающих точек доступа Wi-Fi, устройств с Bluetooth и прочими службами.
    </Paragraph>
    <Paragraph>
        Производители операционных систем, такие как Google и Apple ведут удобную базу данных о большинстве точек
        доступа Wi-Fi, устройствах Bluetooth и их местоположении.
        Когда ваш телефон включен (а не находится в режиме «В самолете»), он будет активно сканировать ближайшие
        устройства, Wi-Fi и Bluetooth.
        Точки доступа Wi-Fi и устройства Bluetooth в округе могут определять местоположение с большей
        точностью, чем при использовании GPS.
    </Paragraph>
    <Paragraph>
        Это активное отслеживание и сканирование может непрерывно отправлять телеметрию с этой информацией компаниям
        (Google, Apple, Microsoft).
        Эта информация уникальна и может использоваться для идентификации и отслеживания конкретного пользователя.
        Также таким слежением могут заниматься и мелкие организации.
    </Paragraph>
    <Note>Некоторые уже так делают, например поисковик
        <Link to="https://www.shodan.io/">Shodan</Link>
    </Note>
    <Paragraph>
        Все это позволяет им определять точное местоположение даже при выключенном GPS, а также вести удобный учет всех
        устройств Wi-Fi и Bluetooth по всему миру.
        Ко всем собранным данным могут получить доступ третьи лица.
    </Paragraph>
    <Paragraph>
        Если у вас есть Android, Google, вероятно, знает, где находится телефон, независимо от того, что вы делаете.
        Нельзя полностью доверять настройкам.
        Операционная система создана компанией, которой нужны ваши данные.
    </Paragraph>
</Section>

<Section>
    <Heading anchor="tracking">Автономное отслеживание</Heading>
    <Paragraph>
        Некоторые устройства даже в выключенном режиме продолжают отслеживать и отсылать информацию.
        Поэтому прием «вынимание батарейки» кажется не таким уж и абсурдным, по крайней мере для некоторых устройств:
    </Paragraph>
    <BulletList tight>
        <Item>iPhone и iPad (IOS 13 и выше)</Item>
        <Item>Телефоны Samsung (Android 10 и выше)</Item>
        <Item>Компьютеры MacBook (macOS 10.15 и выше)</Item>
    </BulletList>
    <Paragraph>
        Эти устройства будут продолжать передавать информацию на устройства рядом даже в автономном режиме, используя
        Bluetooth с низким энергопотреблением.
        У них нет прямого доступа к устройствам (которые не подключены к Интернету), вместо этого они используют BLE.
        Состояние этого устройства транслируется через другие ближайшие устройства, имеющие доступ к интернету.
    </Paragraph>
</Section>