<script>
    import P from "$lib/Markup/P.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import Math from "$lib/Math/Math.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
</script>

<Heading>Информация и сообщения</Heading>

<P>
    <b>Информация</b>&nbsp;&mdash; это&nbsp;различные полезные данные и&nbsp;сведения, то, что передается
    посредством сообщений.

    <b>Сообщение</b>&nbsp;&mdash; это&nbsp;то, что несет информацию. Одна и&nbsp;та&nbsp;же&nbsp;информация может
    передаваться с&nbsp;помощью разных сообщений, например, на&nbsp;разных
    языках. Информация, содержащаяся в&nbsp;сообщении, может быть разной в&nbsp;зависимости от&nbsp;контекста, то&nbsp;есть
    она зависит от&nbsp;способа интерпретации сообщения.
</P>

<P>
    Информация, передаваемая сообщением, устанавливается с&nbsp;помощью правил интерпретации. Если <Math m="M"/>&nbsp;&mdash;
    множество сообщений и <Math m="I"/>&nbsp;&mdash; множество сведений (информации), то&nbsp;интерпретация&nbsp;&mdash;
    отображение
</P>

<Math display m="\imath \colon M \to I"/>

<P>
    Она же задает контекст. Например, сообщение &laquo;Продавец мясного отдела гастронома кричит продавщице:
    перестань выбивать мозги!&raquo; несет разную информацию, а сам контекст этим сообщением не задается.
</P>

<Subheading>Языки</Subheading>

<P>
    Множество сообщений <Math m="M"/> является <b>языком</b>, а&nbsp;сообщение <Math m="m \in M"/>&nbsp;&mdash;
    правильно построенный текст языка <Math m="M"/>.
</P>

<P>
    Языки бывают конечными и&nbsp;бесконечными. Для&nbsp;задания конечного языка достаточно описать все его тексты.
    Для&nbsp;задания бесконечного языка надо задать правила построения текстов языка, или&nbsp;<b>грамматику
    языка</b>.
</P>
