<script>
    import Title from "$lib/Elements/Title.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import P from "$lib/Markup/P.svelte"
    import Math from "$lib/Math/Math.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import Subheading from "$lib/Markup/Subheading.svelte"
</script>

<Title title="Древние шифры"
/>

<Par>
    <P>
        Хорошим примером одноалфавитного кодирования являются древние шифры.
    </P>
    <P>
        Предысторию всего этого можно почитать в большом количестве учебников, книг и сайтов.
        Я здесь сосредоточусь на содержательной составляющей.
    </P>
</Par>

<Par>
    <P>
        У нас есть алфавит <Math m={`A`}/>.
        Мы хотим научиться шифровать тексты языка <Math m={`A^*`}/>, превращая их в другие тексты этого же языка.
    </P>
    <P>
        Для этого нам нужно придумать биекцию <Math m={`\\encrypt \\colon A^* \\bijto A^*`}/>.
        Тогда шифром текста <Math m={`m \\in A^*`}/> будет являться текст <Math m={`c = \\encrypt(m)`}/>.
        Текст <Math m={`c`}/> еще называется <b>шифротекстом</b>.
    </P>
    <P>
        Обратный процесс, процесс расшифровки, происходит применением
        обратного отображения <Math m={`\\decrypt = \\encrypt^{-1}`}/> к шифротексту.
    </P>
    <P>
        С точки зрения кодирования, <Math m={`\\encrypt`}/> &mdash; функция операции кодирования,
        а <Math m={`\\decrypt`}/> &mdash; функция операции декодирования.
    </P>
</Par>


<Heading>Сдвиговые шифры</Heading>

<Par>
    <P>
        Одни из самых первых шифров были сдвиговые.
    </P>
    <P>
        За каждой буквой алфавита закреплен её порядковый номер в алфавите.
        Далее все операции мы будем совершать над этими номерами, так что можно считать, что алфавит уже состоит из цифр.
    </P>
</Par>

<Subheading>Шифр Цезаря</Subheading>

<Par>
    <P>

    </P>
</Par>