<script>
    import Title from "$lib/Elements/Title.svelte"
    import P from "$lib/Markup/P.svelte"
    import Code from "$lib/Code/Code.svelte"
    import Definition from "$lib/Stencils/Blocks/Definition.svelte"
    import Par from "$lib/Markup/Par.svelte"
</script>

<Title title="Переменные и имена"
/>

<Definition title="Переменная">
    <P>
        <b>Переменная</b> (в императивном программировании) &mdash; именованный или адресуемый участок памяти.
        Имя или адрес используются для доступа к данным, хранящимся в этом участке памяти.
        Сами данные называются значением переменной.
        Свойства этих данных определяются типом переменной.
    </P>
</Definition>


<Par>
    <P>
        Например, создаем мы переменную <Code c="int a = 1"/> (в языке C).
        Где-то в оперативной памяти выделился участок в 4 байта, и в него поместилось значение <Code c="0x00000001"/>.
        Доступ к этому значению можно получить по имени <Code c="a"/>, которое теперь закреплено за этим участком
        памяти.
    </P>
    <P>
        Можно по имени явно получить адрес, где хранится значение переменной.
        Такой объект называется <b>указателем</b>.
        В языке C, например, указатель на переменную <Code c="a"/> записывается как <Code c="*a"/>.
    </P>
</Par>


