<Title title="Трансляторы"
/>

<Par>
    <P>
        Компьютер умеет исполнять команды в машинном коде. Человек же пишет
        программы
        <Weak>в основном</Weak>
        на английском языке. Получается, что
        нам просто необходим переводчик -- специальная программа, называемая
        транслятором.
    </P>
</Par>
<DefinitionBox>
    <b>Транслятор</b> -- программа или устройство, переводящая информацию с
    языка понятного человеку, на язык, понятный устройству.
</DefinitionBox>
<Par>
    <P>Трансляторы бывают двух типов: компиляторы и интерпретаторы.</P>
    <P>
        Компилятор читает всю программу целиком и переводит ее в машинный код,
        создавая в результате один бинарный файл. Таким образом, компьютер
        сразу исполняет понятный ему набор байт из этого файла.
    </P>
</Par>
