<script>
    import Title from "$lib/Elements/Title.svelte"
    import Definition from "$lib/Stencils/Blocks/Definition.svelte"
    import Heading from "$lib/Markup/Heading.svelte"
    import P from "$lib/Markup/P.svelte"
    import Par from "$lib/Markup/Par.svelte"
</script>

<Title title="Парадигмы программирования"
/>

<Definition header="Парадигма программирования">
    <b>Парадигма программирования</b> -- это совокупность принципов, методов
    и понятий, определяющих способ написания программ.
</Definition>

<Heading>Функциональное программирование</Heading>

<Par>
    <P>
        В функциональном программировании код строится с помощью композиций
        чистых функций, в котором отсутствуют разделяемые состояния, изменяемые
        данные и побочные эффекты.
    </P>
</Par>

<Definition title="Чистая функция">
    <P>
        <b>Чистая функция</b> &mdash; детерминированная функция, не изменяющая среду
        выполнения программы. Детерминированная функция возвращает одинаковый
        результат для одних и тех же входных данных.
    </P>
</Definition>

<Definition title="Разделяемое состояние">
    <P>
        <b>Разделяемое состояние</b> &mdash; любая переменная, объект, пространство в памяти
        или свойство объекта, существующее в разделяемой области видимости и
        изменяемое несколькими функциями.
    </P>
</Definition>
