<script>
    import Section from "$lib/Markup/Section.svelte"
    import Par from "$lib/Markup/Par.svelte"
    import P from "$lib/Markup/P.svelte"
    import Math from "$lib/Math/Math.svelte"
</script>

<Section>
    <P>
        Задачи построения оптимальных маршрутов порой настолько сложны, что детерминированные алгоритмы использовать не
        целесообразно.
        На помощь приходит агентный подход и роевой интеллект.
    </P>
    <P>
        Пусть муравьям нужно минимизировать функцию <Math m="f \colon M \to \RR"/>, где <Math m="M"/> &mdash; множество
        всех возможных маршрутов.
    </P>
    <P>
        Маршрут состоит из элементов маршрута <Math m="ij"/> &mdash; элементарных переходов между
        положениями <Math m="i"/> и <Math m="j"/>.
        На каждом элементе маршрута <Math m="ij"/> муравьи оставляют феромон <Math m={`\\tau_{ij}`}/>.
        Каждый элемент маршрута для муравья имеет привлекательность <Math m={`\\eta_{ij}`}/>.
    </P>
    <P>
        Муравьи бегают по пространству. Совершая очередной шаг, муравей делает переход из положения <Math m="i"/> в
        положение <Math m="j"/> с вероятностью
    </P>

    <Math display m={`\\P(\\text{перейти из}~ i ~\\text{в}~ j) =
                      \\frac{(\\tau_{ij})^\\alpha \\cdot (\\eta_{ij})^\\beta}{}`}/>
</Section>